# Introduction to Pandas, Data Cleaning, and Transformation

## 1. Introduction to Pandas library

### 1.1 Overview
Pandas is a popular Python library for data manipulation and analysis. It provides data structures like Series and DataFrame, which are designed to handle a wide variety of data types and enable powerful data manipulation operations.

### 1.2 Installation
If you haven't installed pandas yet, you can do so using the following command:

```bash
!pip install pandas

### 1.3 Importing Pandas
To use pandas in your code, you need to import it. It's common practice to import pandas with the alias pd:

In [2]:
import pandas as pd

## 2. Pandas Data Structures

### 2.1 Series
A Series is a one-dimensional labeled array capable of holding any data type.

Creating a Series

In [3]:
data = [1, 2, 3, 4]
ser = pd.Series(data)
print(ser)

0    1
1    2
2    3
3    4
dtype: int64

### 2.2 DataFrame
A DataFrame is a two-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or SQL table.

Creating a DataFrame

In [22]:
import numpy as np

data = {
    'column1': [1, 2, 3, 4, np.nan, 4],
    'column2': ['A', 'B', 'C', 'D', 'E', 'D']
}
df = pd.DataFrame(data)
df

   column1 column2
0      1.0       A
1      2.0       B
2      3.0       C
3      4.0       D
4      NaN       E
5      4.0       D

## 3. Data Cleaning

### 3.1 Handling Missing Data
Pandas provides various methods to deal with missing data, such as dropna() and fillna().

Drop missing data

In [25]:
df.dropna(inplace=True)

In [26]:
df

   column1 column2
0      1.0       A
1      2.0       B
2      3.0       C
3      4.0       D
5      4.0       D

Fill missing data with a specified value

In [20]:
df.fillna(value=1)

   column1 column2
0      1.0       A
1      2.0       B
2      3.0       C
3      4.0       D
4      1.0       E

### 3.2 Removing Duplicates
Use the drop_duplicates() method to remove duplicate rows from a DataFrame.

In [24]:
df

   column1 column2
0      1.0       A
1      2.0       B
2      3.0       C
3      4.0       D
4      NaN       E
5      4.0       D

In [23]:
df.drop_duplicates()

   column1 column2
0      1.0       A
1      2.0       B
2      3.0       C
3      4.0       D
4      NaN       E

## 4. Data Transformation

### 4.1 Renaming Columns
You can rename columns in a DataFrame using the rename() method.

In [27]:
df.rename(columns={'column1': 'new_name', 'column2': 'new_name2'}, inplace=True)
df

   new_name column2
0       1.0       A
1       2.0       B
2       3.0       C
3       4.0       D
5       4.0       D

### 4.2 Replacing Values
To replace values in a DataFrame, you can use the replace() method.

In [28]:
df.replace({4:5}, inplace=True)
df

   new_name column2
0       1.0       A
1       2.0       B
2       3.0       C
3       5.0       D
5       5.0       D

In [29]:
df.loc[3, "new_name"] = 4

In [30]:
df

   new_name column2
0       1.0       A
1       2.0       B
2       3.0       C
3       4.0       D
5       5.0       D

### 4.3 Sorting Data
You can sort a DataFrame by the values in one or more columns using the sort_values() method.

In [31]:
df

   new_name column2
0       1.0       A
1       2.0       B
2       3.0       C
3       4.0       D
5       5.0       D

In [34]:
df.sort_values(by=['new_name'], ascending=False, inplace=True)

In [35]:
df

   new_name column2
5       5.0       D
3       4.0       D
2       3.0       C
1       2.0       B
0       1.0       A

## 5. Read & Write Data from an Existing file

### 5.1 Reading from csv/Excel

In [ ]:
# !pip install openpyxl

In [ ]:
file1 = "pre-course_survey.csv"
file2 = "pre-course_survey.xlsx"

df_csv = pd.read_csv(file1)
df_excel = pd.read_excel(file2)
df_csv.shape, df_excel.shape

In [ ]:
df_csv

In [ ]:
df_excel

### 5.2 Renaming Columns

In [ ]:
old_cols = df_csv.columns
new_cols = ["timestamp", "python", "datascience", "git", "jupyter", "reproducibility", "nlp", "socialmedia_data", "goals", "skills", "concerns"]
cols_dict = dict(zip(old_cols, new_cols))

In [ ]:
df_csv.rename(columns=cols_dict, inplace=True)

In [ ]:
df_csv

### 5.3 Describing Data

In [ ]:
df_csv.describe()

In [ ]:
df_csv["python"].value_counts()

In [ ]:
df_csv

In [ ]:
df_csv.columns

### Exercise 1

1. Find columns that have values "Yes/No". 
2. Convert "Yes/No" to "1/0" for all of those columns. 
3. Count how many "1" and "0" in each column.

### Exercise 2

1. identify the row(s) where the participant's "reproducibility" == 5
2. find the "goals", "skills", and "concerns" for that participant. hint: `df.loc`